{
  "model_name": "SmolVLA",
  "timestamp": "2026-03-05",
  "source": "repo:data/lerobot/src/lerobot/policies/smolvla/",
  "total_parameters": 402737376,
  "decomposition_steps": [
    {
      "step": 0,
      "name": "Phase 0 - Model Preparation",
      "description": "Traced SmolVLA imports, extracted config values via AutoConfig, created self-contained L3 wrapper with all HF dependencies replaced",
      "result": "PASS",
      "notes": "All 13 config checks matched. Output shape (1,50,32) correct. Deterministic."
    },
    {
      "step": 1,
      "name": "Model -> Layers (L3 -> L2+L1+L0)",
      "original": "level_3_model/smolvla.py",
      "refactored": "steps/step_1_model_to_layers/refactored.py",
      "result": "PASS",
      "max_diff": "0.00e+00",
      "weight_map": "500 mapped, 0 unmapped original, 4 unmapped refactored (shared refs)",
      "children": ["vision_encoder(L2)", "vlm_transformer_block(L2)x16", "expert_transformer_block(L2)x16", "connector(L1)", "action_time_mlp(L1)", "text_embed(L0)", "state_proj(L0)", "action_in_proj(L0)", "action_out_proj(L0)", "vlm_norm(L0)", "expert_norm(L0)"],
      "skip_anticheat": true,
      "anticheat_reason": "Joint VLM+Expert attention orchestration requires torch.matmul, F.softmax, RoPE in forward"
    },
    {
      "step": 2,
      "name": "Vision Encoder -> Fusions (L2 -> L1+L0)",
      "original": "level_2_layer/vision_encoder.py",
      "refactored": "steps/step_2_vision_encoder_to_fusions/refactored.py",
      "result": "PASS",
      "max_diff": "0.00e+00",
      "weight_map": "198 mapped, 0 unmapped",
      "children": ["vision_embeddings(L1)", "vision_encoder_layer(L1)x12", "layer_norm_768(L0)"],
      "skip_anticheat": true
    },
    {
      "step": 3,
      "name": "VLM Block -> Fusions (L2 -> L1+L0)",
      "original": "level_2_layer/vlm_transformer_block.py",
      "refactored": "steps/step_3_vlm_block_to_fusions/refactored.py",
      "result": "PASS",
      "max_diff": "0.00e+00",
      "weight_map": "9 mapped, 0 unmapped",
      "children": ["rms_norm_960(L0)x2", "linear_960x960(L0)x2", "linear_960x320(L0)x2", "vlm_mlp(L1)"],
      "skip_anticheat": true,
      "anticheat_reason": "Attention arithmetic (matmul, softmax, RoPE, GQA expansion)"
    },
    {
      "step": 4,
      "name": "Expert Block -> Fusions (L2 -> L1+L0)",
      "original": "level_2_layer/expert_transformer_block.py",
      "refactored": "steps/step_4_expert_block_to_fusions/refactored.py",
      "result": "PASS",
      "max_diff": "0.00e+00",
      "weight_map": "9 mapped, 0 unmapped",
      "children": ["rms_norm_720(L0)x2", "linear_720x960(L0)", "linear_720x320(L0)x2", "linear_960x720(L0)", "expert_mlp(L1)"],
      "skip_anticheat": true,
      "anticheat_reason": "Attention arithmetic (matmul, softmax, RoPE, GQA expansion)"
    },
    {
      "step": 5,
      "name": "Connector -> Kernels (L1 -> L0)",
      "original": "level_1_fusion/connector.py",
      "refactored": "steps/step_5_connector_to_kernels/refactored.py",
      "result": "PASS",
      "max_diff": "0.00e+00",
      "weight_map": "1 mapped, 0 unmapped",
      "children": ["linear_12288x960(L0)"],
      "skip_anticheat": true
    },
    {
      "step": 6,
      "name": "Action-Time MLP -> Kernels (L1 -> L0)",
      "original": "level_1_fusion/action_time_mlp.py",
      "refactored": "steps/step_6_action_time_mlp_to_kernels/refactored.py",
      "result": "PASS",
      "max_diff": "0.00e+00",
      "weight_map": "4 mapped, 0 unmapped",
      "children": ["linear_1440x720(L0)", "silu(L0)", "linear_720x720(L0)"],
      "skip_anticheat": true
    },
    {
      "step": 7,
      "name": "Vision Embeddings -> Kernels (L1 -> L0)",
      "original": "level_1_fusion/vision_embeddings.py",
      "refactored": "steps/step_7_vision_embeddings_to_kernels/refactored.py",
      "result": "PASS",
      "max_diff": "0.00e+00",
      "weight_map": "4 mapped, 0 unmapped",
      "children": ["conv2d_3x768_16x16(L0)", "embedding_1024x768(L0)"],
      "skip_anticheat": true
    },
    {
      "step": 8,
      "name": "Vision Encoder Layer -> Kernels (L1 -> L0)",
      "original": "level_1_fusion/vision_encoder_layer.py",
      "refactored": "steps/step_8_vision_encoder_layer_to_kernels/refactored.py",
      "result": "PASS",
      "max_diff": "0.00e+00",
      "weight_map": "16 mapped, 0 unmapped",
      "children": ["layer_norm_768(L0)x2", "linear_768x768(L0)x4", "gelu_tanh(L0)", "linear_768x3072(L0)", "linear_3072x768(L0)"],
      "skip_anticheat": true,
      "anticheat_reason": "Attention arithmetic (matmul, softmax)"
    },
    {
      "step": 9,
      "name": "VLM MLP -> Kernels (L1 -> L0)",
      "original": "level_1_fusion/vlm_mlp.py",
      "refactored": "steps/step_9_vlm_mlp_to_kernels/refactored.py",
      "result": "PASS",
      "max_diff": "0.00e+00",
      "weight_map": "3 mapped, 0 unmapped",
      "children": ["linear_960x2560(L0)x2", "silu(L0)", "linear_2560x960(L0)"],
      "skip_anticheat": true
    },
    {
      "step": 10,
      "name": "Expert MLP -> Kernels (L1 -> L0)",
      "original": "level_1_fusion/expert_mlp.py",
      "refactored": "steps/step_10_expert_mlp_to_kernels/refactored.py",
      "result": "PASS",
      "max_diff": "0.00e+00",
      "weight_map": "3 mapped, 0 unmapped",
      "children": ["linear_720x2048(L0)x2", "silu(L0)", "linear_2048x720(L0)"],
      "skip_anticheat": true
    }
  ],
  "coverage_analysis": {
    "method": "torch.compile",
    "total_original_compute_ops": 483,
    "unique_kernel_types": 28,
    "op_types_covered": ["conv2d", "embedding", "gelu", "layer_norm", "linear", "matmul", "silu", "softmax"],
    "notes": "Coverage percentage is low (4.8%) because extract_ops counts per-instance ops (e.g., 302 linear calls across all layers) while L0 kernels are deduplicated (one file per unique workload shape). All 8 compute op types are represented in the kernel files."
  },
  "composition_test": {
    "result": "PASS",
    "max_diff": "0.00e+00",
    "method": "verify original L3 model vs step 1 refactored model (which delegates to all children)"
  },
  "kernel_deduplication": {
    "total_unique_kernels": 28,
    "naming_convention": "{operation}_{shape_signature}_{dtype}.py",
    "examples": [
      "linear_960x960_fp32.py - used by VLM Q/O projections (32 instances across 16 layers)",
      "rms_norm_960_fp32.py - used by VLM input/post-attention layernorms (32 instances)",
      "silu_fp32.py - used by all SwiGLU MLPs and action-time MLP (shared kernel)"
    ]
  }
}
