{
  "timestamp": "2026-03-05T02:56:57.239236",
  "original_file": "decompose-workspace\\iteration-2\\eval-4-smolvla\\with_skill\\outputs\\steps\\step_8_vision_encoder_layer_to_kernels\\original.py",
  "refactored_file": "decompose-workspace\\iteration-2\\eval-4-smolvla\\with_skill\\outputs\\steps\\step_8_vision_encoder_layer_to_kernels\\refactored.py",
  "status": "PASS",
  "anticheat": {
    "status": "SKIPPED",
    "violations": []
  },
  "weight_transfer": {
    "status": "OK",
    "mapped_count": 16,
    "unmapped_original": [],
    "unmapped_refactored": [],
    "weight_map": {
      "self_attn.q_proj.weight": "self_attn.q_proj.weight",
      "self_attn.q_proj.bias": "self_attn.q_proj.bias",
      "self_attn.k_proj.weight": "self_attn.k_proj.weight",
      "self_attn.k_proj.bias": "self_attn.k_proj.bias",
      "self_attn.v_proj.weight": "self_attn.v_proj.weight",
      "self_attn.v_proj.bias": "self_attn.v_proj.bias",
      "self_attn.out_proj.weight": "self_attn.out_proj.weight",
      "self_attn.out_proj.bias": "self_attn.out_proj.bias",
      "layer_norm1.weight": "layer_norm1.weight",
      "layer_norm1.bias": "layer_norm1.bias",
      "mlp.fc1.weight": "mlp.fc1.weight",
      "mlp.fc1.bias": "mlp.fc1.bias",
      "mlp.fc2.weight": "mlp.fc2.weight",
      "mlp.fc2.bias": "mlp.fc2.bias",
      "layer_norm2.weight": "layer_norm2.weight",
      "layer_norm2.bias": "layer_norm2.bias"
    }
  },
  "numerical_comparison": {
    "status": "PASS",
    "rtol": 1e-05,
    "atol": 1e-06,
    "input_dtype": "torch.float32",
    "num_trials": 3,
    "max_diff_across_trials": 0.0,
    "trials": [
      {
        "trial": 0,
        "seed": 42,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              1,
              1024,
              768
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      },
      {
        "trial": 1,
        "seed": 43,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              1,
              1024,
              768
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      },
      {
        "trial": 2,
        "seed": 44,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              1,
              1024,
              768
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      }
    ]
  }
}