{
  "timestamp": "2026-03-05T02:39:13.911755",
  "original_file": "decompose-workspace\\iteration-2\\eval-3-gpt-oss\\with_skill\\outputs\\steps\\step_3b_mlp_block_to_kernels\\original.py",
  "refactored_file": "decompose-workspace\\iteration-2\\eval-3-gpt-oss\\with_skill\\outputs\\steps\\step_3b_mlp_block_to_kernels\\refactored.py",
  "status": "PASS",
  "anticheat": {
    "status": "PASS",
    "violations": [],
    "source_violations": [],
    "parameter_violations": []
  },
  "weight_transfer": {
    "status": "OK",
    "mapped_count": 7,
    "unmapped_original": [],
    "unmapped_refactored": [],
    "weight_map": {
      "norm.scale": "norm.scale",
      "gate.weight": "gate.linear.weight",
      "gate.bias": "gate.linear.bias",
      "mlp1_weight": "mlp1.mlp1_weight",
      "mlp1_bias": "mlp1.mlp1_bias",
      "mlp2_weight": "mlp2.mlp2_weight",
      "mlp2_bias": "mlp2.mlp2_bias"
    }
  },
  "numerical_comparison": {
    "status": "PASS",
    "rtol": 0.001,
    "atol": 0.001,
    "input_dtype": "torch.bfloat16",
    "num_trials": 3,
    "max_diff_across_trials": 0.0,
    "trials": [
      {
        "trial": 0,
        "seed": 42,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              32,
              2880
            ],
            "dtype": "torch.bfloat16",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      },
      {
        "trial": 1,
        "seed": 43,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              32,
              2880
            ],
            "dtype": "torch.bfloat16",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      },
      {
        "trial": 2,
        "seed": 44,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              32,
              2880
            ],
            "dtype": "torch.bfloat16",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      }
    ]
  }
}