{
  "timestamp": "2026-03-05T01:41:17.522853",
  "original_file": "decompose-workspace\\iteration-1\\eval-2-inception-module\\with_skill\\outputs\\steps\\step_2_branch5x5_to_kernels\\original.py",
  "refactored_file": "decompose-workspace\\iteration-1\\eval-2-inception-module\\with_skill\\outputs\\steps\\step_2_branch5x5_to_kernels\\refactored.py",
  "status": "PASS",
  "anticheat": {
    "status": "PASS",
    "violations": [],
    "source_violations": [],
    "parameter_violations": []
  },
  "weight_transfer": {
    "status": "OK",
    "mapped_count": 4,
    "unmapped_original": [],
    "unmapped_refactored": [],
    "weight_map": {
      "reduce.weight": "reduce.conv.weight",
      "reduce.bias": "reduce.conv.bias",
      "conv.weight": "conv.conv.weight",
      "conv.bias": "conv.conv.bias"
    }
  },
  "numerical_comparison": {
    "status": "PASS",
    "rtol": 1e-05,
    "atol": 1e-06,
    "input_dtype": "torch.float32",
    "num_trials": 3,
    "max_diff_across_trials": 0.0,
    "trials": [
      {
        "trial": 0,
        "seed": 42,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              10,
              48,
              224,
              224
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      },
      {
        "trial": 1,
        "seed": 43,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              10,
              48,
              224,
              224
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      },
      {
        "trial": 2,
        "seed": 44,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              10,
              48,
              224,
              224
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      }
    ]
  }
}