{
  "timestamp": "2026-03-05T02:51:30.863599",
  "original_file": "decompose-workspace\\iteration-2\\eval-4-smolvla\\with_skill\\outputs\\steps\\step_2_vision_encoder_to_fusions\\original.py",
  "refactored_file": "decompose-workspace\\iteration-2\\eval-4-smolvla\\with_skill\\outputs\\steps\\step_2_vision_encoder_to_fusions\\refactored.py",
  "status": "PASS",
  "anticheat": {
    "status": "SKIPPED",
    "violations": []
  },
  "weight_transfer": {
    "status": "OK",
    "mapped_count": 198,
    "unmapped_original": [],
    "unmapped_refactored": [],
    "weight_map": {
      "embeddings.position_ids": "embeddings.position_ids",
      "embeddings.patch_embedding.weight": "embeddings.patch_embedding.weight",
      "embeddings.patch_embedding.bias": "embeddings.patch_embedding.bias",
      "embeddings.position_embedding.weight": "embeddings.position_embedding.weight",
      "layers.0.self_attn.q_proj.weight": "layers.0.self_attn.q_proj.weight",
      "layers.0.self_attn.q_proj.bias": "layers.0.self_attn.q_proj.bias",
      "layers.0.self_attn.k_proj.weight": "layers.0.self_attn.k_proj.weight",
      "layers.0.self_attn.k_proj.bias": "layers.0.self_attn.k_proj.bias",
      "layers.0.self_attn.v_proj.weight": "layers.0.self_attn.v_proj.weight",
      "layers.0.self_attn.v_proj.bias": "layers.0.self_attn.v_proj.bias",
      "layers.0.self_attn.out_proj.weight": "layers.0.self_attn.out_proj.weight",
      "layers.0.self_attn.out_proj.bias": "layers.0.self_attn.out_proj.bias",
      "layers.0.layer_norm1.weight": "layers.0.layer_norm1.weight",
      "layers.0.layer_norm1.bias": "layers.0.layer_norm1.bias",
      "layers.0.mlp.fc1.weight": "layers.0.mlp.fc1.weight",
      "layers.0.mlp.fc1.bias": "layers.0.mlp.fc1.bias",
      "layers.0.mlp.fc2.weight": "layers.0.mlp.fc2.weight",
      "layers.0.mlp.fc2.bias": "layers.0.mlp.fc2.bias",
      "layers.0.layer_norm2.weight": "layers.0.layer_norm2.weight",
      "layers.0.layer_norm2.bias": "layers.0.layer_norm2.bias",
      "layers.1.self_attn.q_proj.weight": "layers.1.self_attn.q_proj.weight",
      "layers.1.self_attn.q_proj.bias": "layers.1.self_attn.q_proj.bias",
      "layers.1.self_attn.k_proj.weight": "layers.1.self_attn.k_proj.weight",
      "layers.1.self_attn.k_proj.bias": "layers.1.self_attn.k_proj.bias",
      "layers.1.self_attn.v_proj.weight": "layers.1.self_attn.v_proj.weight",
      "layers.1.self_attn.v_proj.bias": "layers.1.self_attn.v_proj.bias",
      "layers.1.self_attn.out_proj.weight": "layers.1.self_attn.out_proj.weight",
      "layers.1.self_attn.out_proj.bias": "layers.1.self_attn.out_proj.bias",
      "layers.1.layer_norm1.weight": "layers.1.layer_norm1.weight",
      "layers.1.layer_norm1.bias": "layers.1.layer_norm1.bias",
      "layers.1.mlp.fc1.weight": "layers.1.mlp.fc1.weight",
      "layers.1.mlp.fc1.bias": "layers.1.mlp.fc1.bias",
      "layers.1.mlp.fc2.weight": "layers.1.mlp.fc2.weight",
      "layers.1.mlp.fc2.bias": "layers.1.mlp.fc2.bias",
      "layers.1.layer_norm2.weight": "layers.1.layer_norm2.weight",
      "layers.1.layer_norm2.bias": "layers.1.layer_norm2.bias",
      "layers.2.self_attn.q_proj.weight": "layers.2.self_attn.q_proj.weight",
      "layers.2.self_attn.q_proj.bias": "layers.2.self_attn.q_proj.bias",
      "layers.2.self_attn.k_proj.weight": "layers.2.self_attn.k_proj.weight",
      "layers.2.self_attn.k_proj.bias": "layers.2.self_attn.k_proj.bias",
      "layers.2.self_attn.v_proj.weight": "layers.2.self_attn.v_proj.weight",
      "layers.2.self_attn.v_proj.bias": "layers.2.self_attn.v_proj.bias",
      "layers.2.self_attn.out_proj.weight": "layers.2.self_attn.out_proj.weight",
      "layers.2.self_attn.out_proj.bias": "layers.2.self_attn.out_proj.bias",
      "layers.2.layer_norm1.weight": "layers.2.layer_norm1.weight",
      "layers.2.layer_norm1.bias": "layers.2.layer_norm1.bias",
      "layers.2.mlp.fc1.weight": "layers.2.mlp.fc1.weight",
      "layers.2.mlp.fc1.bias": "layers.2.mlp.fc1.bias",
      "layers.2.mlp.fc2.weight": "layers.2.mlp.fc2.weight",
      "layers.2.mlp.fc2.bias": "layers.2.mlp.fc2.bias",
      "layers.2.layer_norm2.weight": "layers.2.layer_norm2.weight",
      "layers.2.layer_norm2.bias": "layers.2.layer_norm2.bias",
      "layers.3.self_attn.q_proj.weight": "layers.3.self_attn.q_proj.weight",
      "layers.3.self_attn.q_proj.bias": "layers.3.self_attn.q_proj.bias",
      "layers.3.self_attn.k_proj.weight": "layers.3.self_attn.k_proj.weight",
      "layers.3.self_attn.k_proj.bias": "layers.3.self_attn.k_proj.bias",
      "layers.3.self_attn.v_proj.weight": "layers.3.self_attn.v_proj.weight",
      "layers.3.self_attn.v_proj.bias": "layers.3.self_attn.v_proj.bias",
      "layers.3.self_attn.out_proj.weight": "layers.3.self_attn.out_proj.weight",
      "layers.3.self_attn.out_proj.bias": "layers.3.self_attn.out_proj.bias",
      "layers.3.layer_norm1.weight": "layers.3.layer_norm1.weight",
      "layers.3.layer_norm1.bias": "layers.3.layer_norm1.bias",
      "layers.3.mlp.fc1.weight": "layers.3.mlp.fc1.weight",
      "layers.3.mlp.fc1.bias": "layers.3.mlp.fc1.bias",
      "layers.3.mlp.fc2.weight": "layers.3.mlp.fc2.weight",
      "layers.3.mlp.fc2.bias": "layers.3.mlp.fc2.bias",
      "layers.3.layer_norm2.weight": "layers.3.layer_norm2.weight",
      "layers.3.layer_norm2.bias": "layers.3.layer_norm2.bias",
      "layers.4.self_attn.q_proj.weight": "layers.4.self_attn.q_proj.weight",
      "layers.4.self_attn.q_proj.bias": "layers.4.self_attn.q_proj.bias",
      "layers.4.self_attn.k_proj.weight": "layers.4.self_attn.k_proj.weight",
      "layers.4.self_attn.k_proj.bias": "layers.4.self_attn.k_proj.bias",
      "layers.4.self_attn.v_proj.weight": "layers.4.self_attn.v_proj.weight",
      "layers.4.self_attn.v_proj.bias": "layers.4.self_attn.v_proj.bias",
      "layers.4.self_attn.out_proj.weight": "layers.4.self_attn.out_proj.weight",
      "layers.4.self_attn.out_proj.bias": "layers.4.self_attn.out_proj.bias",
      "layers.4.layer_norm1.weight": "layers.4.layer_norm1.weight",
      "layers.4.layer_norm1.bias": "layers.4.layer_norm1.bias",
      "layers.4.mlp.fc1.weight": "layers.4.mlp.fc1.weight",
      "layers.4.mlp.fc1.bias": "layers.4.mlp.fc1.bias",
      "layers.4.mlp.fc2.weight": "layers.4.mlp.fc2.weight",
      "layers.4.mlp.fc2.bias": "layers.4.mlp.fc2.bias",
      "layers.4.layer_norm2.weight": "layers.4.layer_norm2.weight",
      "layers.4.layer_norm2.bias": "layers.4.layer_norm2.bias",
      "layers.5.self_attn.q_proj.weight": "layers.5.self_attn.q_proj.weight",
      "layers.5.self_attn.q_proj.bias": "layers.5.self_attn.q_proj.bias",
      "layers.5.self_attn.k_proj.weight": "layers.5.self_attn.k_proj.weight",
      "layers.5.self_attn.k_proj.bias": "layers.5.self_attn.k_proj.bias",
      "layers.5.self_attn.v_proj.weight": "layers.5.self_attn.v_proj.weight",
      "layers.5.self_attn.v_proj.bias": "layers.5.self_attn.v_proj.bias",
      "layers.5.self_attn.out_proj.weight": "layers.5.self_attn.out_proj.weight",
      "layers.5.self_attn.out_proj.bias": "layers.5.self_attn.out_proj.bias",
      "layers.5.layer_norm1.weight": "layers.5.layer_norm1.weight",
      "layers.5.layer_norm1.bias": "layers.5.layer_norm1.bias",
      "layers.5.mlp.fc1.weight": "layers.5.mlp.fc1.weight",
      "layers.5.mlp.fc1.bias": "layers.5.mlp.fc1.bias",
      "layers.5.mlp.fc2.weight": "layers.5.mlp.fc2.weight",
      "layers.5.mlp.fc2.bias": "layers.5.mlp.fc2.bias",
      "layers.5.layer_norm2.weight": "layers.5.layer_norm2.weight",
      "layers.5.layer_norm2.bias": "layers.5.layer_norm2.bias",
      "layers.6.self_attn.q_proj.weight": "layers.6.self_attn.q_proj.weight",
      "layers.6.self_attn.q_proj.bias": "layers.6.self_attn.q_proj.bias",
      "layers.6.self_attn.k_proj.weight": "layers.6.self_attn.k_proj.weight",
      "layers.6.self_attn.k_proj.bias": "layers.6.self_attn.k_proj.bias",
      "layers.6.self_attn.v_proj.weight": "layers.6.self_attn.v_proj.weight",
      "layers.6.self_attn.v_proj.bias": "layers.6.self_attn.v_proj.bias",
      "layers.6.self_attn.out_proj.weight": "layers.6.self_attn.out_proj.weight",
      "layers.6.self_attn.out_proj.bias": "layers.6.self_attn.out_proj.bias",
      "layers.6.layer_norm1.weight": "layers.6.layer_norm1.weight",
      "layers.6.layer_norm1.bias": "layers.6.layer_norm1.bias",
      "layers.6.mlp.fc1.weight": "layers.6.mlp.fc1.weight",
      "layers.6.mlp.fc1.bias": "layers.6.mlp.fc1.bias",
      "layers.6.mlp.fc2.weight": "layers.6.mlp.fc2.weight",
      "layers.6.mlp.fc2.bias": "layers.6.mlp.fc2.bias",
      "layers.6.layer_norm2.weight": "layers.6.layer_norm2.weight",
      "layers.6.layer_norm2.bias": "layers.6.layer_norm2.bias",
      "layers.7.self_attn.q_proj.weight": "layers.7.self_attn.q_proj.weight",
      "layers.7.self_attn.q_proj.bias": "layers.7.self_attn.q_proj.bias",
      "layers.7.self_attn.k_proj.weight": "layers.7.self_attn.k_proj.weight",
      "layers.7.self_attn.k_proj.bias": "layers.7.self_attn.k_proj.bias",
      "layers.7.self_attn.v_proj.weight": "layers.7.self_attn.v_proj.weight",
      "layers.7.self_attn.v_proj.bias": "layers.7.self_attn.v_proj.bias",
      "layers.7.self_attn.out_proj.weight": "layers.7.self_attn.out_proj.weight",
      "layers.7.self_attn.out_proj.bias": "layers.7.self_attn.out_proj.bias",
      "layers.7.layer_norm1.weight": "layers.7.layer_norm1.weight",
      "layers.7.layer_norm1.bias": "layers.7.layer_norm1.bias",
      "layers.7.mlp.fc1.weight": "layers.7.mlp.fc1.weight",
      "layers.7.mlp.fc1.bias": "layers.7.mlp.fc1.bias",
      "layers.7.mlp.fc2.weight": "layers.7.mlp.fc2.weight",
      "layers.7.mlp.fc2.bias": "layers.7.mlp.fc2.bias",
      "layers.7.layer_norm2.weight": "layers.7.layer_norm2.weight",
      "layers.7.layer_norm2.bias": "layers.7.layer_norm2.bias",
      "layers.8.self_attn.q_proj.weight": "layers.8.self_attn.q_proj.weight",
      "layers.8.self_attn.q_proj.bias": "layers.8.self_attn.q_proj.bias",
      "layers.8.self_attn.k_proj.weight": "layers.8.self_attn.k_proj.weight",
      "layers.8.self_attn.k_proj.bias": "layers.8.self_attn.k_proj.bias",
      "layers.8.self_attn.v_proj.weight": "layers.8.self_attn.v_proj.weight",
      "layers.8.self_attn.v_proj.bias": "layers.8.self_attn.v_proj.bias",
      "layers.8.self_attn.out_proj.weight": "layers.8.self_attn.out_proj.weight",
      "layers.8.self_attn.out_proj.bias": "layers.8.self_attn.out_proj.bias",
      "layers.8.layer_norm1.weight": "layers.8.layer_norm1.weight",
      "layers.8.layer_norm1.bias": "layers.8.layer_norm1.bias",
      "layers.8.mlp.fc1.weight": "layers.8.mlp.fc1.weight",
      "layers.8.mlp.fc1.bias": "layers.8.mlp.fc1.bias",
      "layers.8.mlp.fc2.weight": "layers.8.mlp.fc2.weight",
      "layers.8.mlp.fc2.bias": "layers.8.mlp.fc2.bias",
      "layers.8.layer_norm2.weight": "layers.8.layer_norm2.weight",
      "layers.8.layer_norm2.bias": "layers.8.layer_norm2.bias",
      "layers.9.self_attn.q_proj.weight": "layers.9.self_attn.q_proj.weight",
      "layers.9.self_attn.q_proj.bias": "layers.9.self_attn.q_proj.bias",
      "layers.9.self_attn.k_proj.weight": "layers.9.self_attn.k_proj.weight",
      "layers.9.self_attn.k_proj.bias": "layers.9.self_attn.k_proj.bias",
      "layers.9.self_attn.v_proj.weight": "layers.9.self_attn.v_proj.weight",
      "layers.9.self_attn.v_proj.bias": "layers.9.self_attn.v_proj.bias",
      "layers.9.self_attn.out_proj.weight": "layers.9.self_attn.out_proj.weight",
      "layers.9.self_attn.out_proj.bias": "layers.9.self_attn.out_proj.bias",
      "layers.9.layer_norm1.weight": "layers.9.layer_norm1.weight",
      "layers.9.layer_norm1.bias": "layers.9.layer_norm1.bias",
      "layers.9.mlp.fc1.weight": "layers.9.mlp.fc1.weight",
      "layers.9.mlp.fc1.bias": "layers.9.mlp.fc1.bias",
      "layers.9.mlp.fc2.weight": "layers.9.mlp.fc2.weight",
      "layers.9.mlp.fc2.bias": "layers.9.mlp.fc2.bias",
      "layers.9.layer_norm2.weight": "layers.9.layer_norm2.weight",
      "layers.9.layer_norm2.bias": "layers.9.layer_norm2.bias",
      "layers.10.self_attn.q_proj.weight": "layers.10.self_attn.q_proj.weight",
      "layers.10.self_attn.q_proj.bias": "layers.10.self_attn.q_proj.bias",
      "layers.10.self_attn.k_proj.weight": "layers.10.self_attn.k_proj.weight",
      "layers.10.self_attn.k_proj.bias": "layers.10.self_attn.k_proj.bias",
      "layers.10.self_attn.v_proj.weight": "layers.10.self_attn.v_proj.weight",
      "layers.10.self_attn.v_proj.bias": "layers.10.self_attn.v_proj.bias",
      "layers.10.self_attn.out_proj.weight": "layers.10.self_attn.out_proj.weight",
      "layers.10.self_attn.out_proj.bias": "layers.10.self_attn.out_proj.bias",
      "layers.10.layer_norm1.weight": "layers.10.layer_norm1.weight",
      "layers.10.layer_norm1.bias": "layers.10.layer_norm1.bias",
      "layers.10.mlp.fc1.weight": "layers.10.mlp.fc1.weight",
      "layers.10.mlp.fc1.bias": "layers.10.mlp.fc1.bias",
      "layers.10.mlp.fc2.weight": "layers.10.mlp.fc2.weight",
      "layers.10.mlp.fc2.bias": "layers.10.mlp.fc2.bias",
      "layers.10.layer_norm2.weight": "layers.10.layer_norm2.weight",
      "layers.10.layer_norm2.bias": "layers.10.layer_norm2.bias",
      "layers.11.self_attn.q_proj.weight": "layers.11.self_attn.q_proj.weight",
      "layers.11.self_attn.q_proj.bias": "layers.11.self_attn.q_proj.bias",
      "layers.11.self_attn.k_proj.weight": "layers.11.self_attn.k_proj.weight",
      "layers.11.self_attn.k_proj.bias": "layers.11.self_attn.k_proj.bias",
      "layers.11.self_attn.v_proj.weight": "layers.11.self_attn.v_proj.weight",
      "layers.11.self_attn.v_proj.bias": "layers.11.self_attn.v_proj.bias",
      "layers.11.self_attn.out_proj.weight": "layers.11.self_attn.out_proj.weight",
      "layers.11.self_attn.out_proj.bias": "layers.11.self_attn.out_proj.bias",
      "layers.11.layer_norm1.weight": "layers.11.layer_norm1.weight",
      "layers.11.layer_norm1.bias": "layers.11.layer_norm1.bias",
      "layers.11.mlp.fc1.weight": "layers.11.mlp.fc1.weight",
      "layers.11.mlp.fc1.bias": "layers.11.mlp.fc1.bias",
      "layers.11.mlp.fc2.weight": "layers.11.mlp.fc2.weight",
      "layers.11.mlp.fc2.bias": "layers.11.mlp.fc2.bias",
      "layers.11.layer_norm2.weight": "layers.11.layer_norm2.weight",
      "layers.11.layer_norm2.bias": "layers.11.layer_norm2.bias",
      "post_layernorm.weight": "post_layernorm.weight",
      "post_layernorm.bias": "post_layernorm.bias"
    }
  },
  "numerical_comparison": {
    "status": "PASS",
    "rtol": 1e-05,
    "atol": 1e-06,
    "input_dtype": "torch.float32",
    "num_trials": 3,
    "max_diff_across_trials": 0.0,
    "trials": [
      {
        "trial": 0,
        "seed": 42,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              1,
              1024,
              768
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      },
      {
        "trial": 1,
        "seed": 43,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              1,
              1024,
              768
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      },
      {
        "trial": 2,
        "seed": 44,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              1,
              1024,
              768
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      }
    ]
  }
}