{
  "timestamp": "2026-03-05T02:53:06.156582",
  "original_file": "decompose-workspace\\iteration-2\\eval-4-smolvla\\with_skill\\outputs\\steps\\step_3_vlm_block_to_fusions\\original.py",
  "refactored_file": "decompose-workspace\\iteration-2\\eval-4-smolvla\\with_skill\\outputs\\steps\\step_3_vlm_block_to_fusions\\refactored.py",
  "status": "PASS",
  "anticheat": {
    "status": "SKIPPED",
    "violations": []
  },
  "weight_transfer": {
    "status": "OK",
    "mapped_count": 9,
    "unmapped_original": [],
    "unmapped_refactored": [],
    "weight_map": {
      "input_layernorm.weight": "input_layernorm.weight",
      "q_proj.weight": "q_proj.weight",
      "k_proj.weight": "k_proj.weight",
      "v_proj.weight": "v_proj.weight",
      "o_proj.weight": "o_proj.weight",
      "post_attention_layernorm.weight": "post_attention_layernorm.weight",
      "mlp.gate_proj.weight": "mlp.gate_proj.weight",
      "mlp.up_proj.weight": "mlp.up_proj.weight",
      "mlp.down_proj.weight": "mlp.down_proj.weight"
    }
  },
  "numerical_comparison": {
    "status": "PASS",
    "rtol": 1e-05,
    "atol": 1e-06,
    "input_dtype": "torch.float32",
    "num_trials": 3,
    "max_diff_across_trials": 0.0,
    "trials": [
      {
        "trial": 0,
        "seed": 42,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              1,
              113,
              960
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      },
      {
        "trial": 1,
        "seed": 43,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              1,
              113,
              960
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      },
      {
        "trial": 2,
        "seed": 44,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              1,
              113,
              960
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      }
    ]
  }
}