{
  "timestamp": "2026-03-05T02:47:56.075888",
  "original_file": "decompose-workspace\\iteration-2\\eval-4-smolvla\\with_skill\\outputs\\steps\\step_1_model_to_layers\\original.py",
  "refactored_file": "decompose-workspace\\iteration-2\\eval-4-smolvla\\with_skill\\outputs\\steps\\step_1_model_to_layers\\refactored.py",
  "status": "PASS",
  "anticheat": {
    "status": "SKIPPED",
    "violations": []
  },
  "weight_transfer": {
    "status": "OK",
    "mapped_count": 500,
    "unmapped_original": [],
    "unmapped_refactored": [
      "_action_time_mlp.mlp_in.weight",
      "_action_time_mlp.mlp_in.bias",
      "_action_time_mlp.mlp_out.weight",
      "_action_time_mlp.mlp_out.bias"
    ],
    "weight_map": {
      "vision_encoder.embeddings.position_ids": "vision_encoder.embeddings.position_ids",
      "vision_encoder.embeddings.patch_embedding.weight": "vision_encoder.embeddings.patch_embedding.weight",
      "vision_encoder.embeddings.patch_embedding.bias": "vision_encoder.embeddings.patch_embedding.bias",
      "vision_encoder.embeddings.position_embedding.weight": "vision_encoder.embeddings.position_embedding.weight",
      "vision_encoder.layers.0.self_attn.q_proj.weight": "vision_encoder.layers.0.self_attn.q_proj.weight",
      "vision_encoder.layers.0.self_attn.q_proj.bias": "vision_encoder.layers.0.self_attn.q_proj.bias",
      "vision_encoder.layers.0.self_attn.k_proj.weight": "vision_encoder.layers.0.self_attn.k_proj.weight",
      "vision_encoder.layers.0.self_attn.k_proj.bias": "vision_encoder.layers.0.self_attn.k_proj.bias",
      "vision_encoder.layers.0.self_attn.v_proj.weight": "vision_encoder.layers.0.self_attn.v_proj.weight",
      "vision_encoder.layers.0.self_attn.v_proj.bias": "vision_encoder.layers.0.self_attn.v_proj.bias",
      "vision_encoder.layers.0.self_attn.out_proj.weight": "vision_encoder.layers.0.self_attn.out_proj.weight",
      "vision_encoder.layers.0.self_attn.out_proj.bias": "vision_encoder.layers.0.self_attn.out_proj.bias",
      "vision_encoder.layers.0.layer_norm1.weight": "vision_encoder.layers.0.layer_norm1.weight",
      "vision_encoder.layers.0.layer_norm1.bias": "vision_encoder.layers.0.layer_norm1.bias",
      "vision_encoder.layers.0.mlp.fc1.weight": "vision_encoder.layers.0.mlp.fc1.weight",
      "vision_encoder.layers.0.mlp.fc1.bias": "vision_encoder.layers.0.mlp.fc1.bias",
      "vision_encoder.layers.0.mlp.fc2.weight": "vision_encoder.layers.0.mlp.fc2.weight",
      "vision_encoder.layers.0.mlp.fc2.bias": "vision_encoder.layers.0.mlp.fc2.bias",
      "vision_encoder.layers.0.layer_norm2.weight": "vision_encoder.layers.0.layer_norm2.weight",
      "vision_encoder.layers.0.layer_norm2.bias": "vision_encoder.layers.0.layer_norm2.bias",
      "vision_encoder.layers.1.self_attn.q_proj.weight": "vision_encoder.layers.1.self_attn.q_proj.weight",
      "vision_encoder.layers.1.self_attn.q_proj.bias": "vision_encoder.layers.1.self_attn.q_proj.bias",
      "vision_encoder.layers.1.self_attn.k_proj.weight": "vision_encoder.layers.1.self_attn.k_proj.weight",
      "vision_encoder.layers.1.self_attn.k_proj.bias": "vision_encoder.layers.1.self_attn.k_proj.bias",
      "vision_encoder.layers.1.self_attn.v_proj.weight": "vision_encoder.layers.1.self_attn.v_proj.weight",
      "vision_encoder.layers.1.self_attn.v_proj.bias": "vision_encoder.layers.1.self_attn.v_proj.bias",
      "vision_encoder.layers.1.self_attn.out_proj.weight": "vision_encoder.layers.1.self_attn.out_proj.weight",
      "vision_encoder.layers.1.self_attn.out_proj.bias": "vision_encoder.layers.1.self_attn.out_proj.bias",
      "vision_encoder.layers.1.layer_norm1.weight": "vision_encoder.layers.1.layer_norm1.weight",
      "vision_encoder.layers.1.layer_norm1.bias": "vision_encoder.layers.1.layer_norm1.bias",
      "vision_encoder.layers.1.mlp.fc1.weight": "vision_encoder.layers.1.mlp.fc1.weight",
      "vision_encoder.layers.1.mlp.fc1.bias": "vision_encoder.layers.1.mlp.fc1.bias",
      "vision_encoder.layers.1.mlp.fc2.weight": "vision_encoder.layers.1.mlp.fc2.weight",
      "vision_encoder.layers.1.mlp.fc2.bias": "vision_encoder.layers.1.mlp.fc2.bias",
      "vision_encoder.layers.1.layer_norm2.weight": "vision_encoder.layers.1.layer_norm2.weight",
      "vision_encoder.layers.1.layer_norm2.bias": "vision_encoder.layers.1.layer_norm2.bias",
      "vision_encoder.layers.2.self_attn.q_proj.weight": "vision_encoder.layers.2.self_attn.q_proj.weight",
      "vision_encoder.layers.2.self_attn.q_proj.bias": "vision_encoder.layers.2.self_attn.q_proj.bias",
      "vision_encoder.layers.2.self_attn.k_proj.weight": "vision_encoder.layers.2.self_attn.k_proj.weight",
      "vision_encoder.layers.2.self_attn.k_proj.bias": "vision_encoder.layers.2.self_attn.k_proj.bias",
      "vision_encoder.layers.2.self_attn.v_proj.weight": "vision_encoder.layers.2.self_attn.v_proj.weight",
      "vision_encoder.layers.2.self_attn.v_proj.bias": "vision_encoder.layers.2.self_attn.v_proj.bias",
      "vision_encoder.layers.2.self_attn.out_proj.weight": "vision_encoder.layers.2.self_attn.out_proj.weight",
      "vision_encoder.layers.2.self_attn.out_proj.bias": "vision_encoder.layers.2.self_attn.out_proj.bias",
      "vision_encoder.layers.2.layer_norm1.weight": "vision_encoder.layers.2.layer_norm1.weight",
      "vision_encoder.layers.2.layer_norm1.bias": "vision_encoder.layers.2.layer_norm1.bias",
      "vision_encoder.layers.2.mlp.fc1.weight": "vision_encoder.layers.2.mlp.fc1.weight",
      "vision_encoder.layers.2.mlp.fc1.bias": "vision_encoder.layers.2.mlp.fc1.bias",
      "vision_encoder.layers.2.mlp.fc2.weight": "vision_encoder.layers.2.mlp.fc2.weight",
      "vision_encoder.layers.2.mlp.fc2.bias": "vision_encoder.layers.2.mlp.fc2.bias",
      "vision_encoder.layers.2.layer_norm2.weight": "vision_encoder.layers.2.layer_norm2.weight",
      "vision_encoder.layers.2.layer_norm2.bias": "vision_encoder.layers.2.layer_norm2.bias",
      "vision_encoder.layers.3.self_attn.q_proj.weight": "vision_encoder.layers.3.self_attn.q_proj.weight",
      "vision_encoder.layers.3.self_attn.q_proj.bias": "vision_encoder.layers.3.self_attn.q_proj.bias",
      "vision_encoder.layers.3.self_attn.k_proj.weight": "vision_encoder.layers.3.self_attn.k_proj.weight",
      "vision_encoder.layers.3.self_attn.k_proj.bias": "vision_encoder.layers.3.self_attn.k_proj.bias",
      "vision_encoder.layers.3.self_attn.v_proj.weight": "vision_encoder.layers.3.self_attn.v_proj.weight",
      "vision_encoder.layers.3.self_attn.v_proj.bias": "vision_encoder.layers.3.self_attn.v_proj.bias",
      "vision_encoder.layers.3.self_attn.out_proj.weight": "vision_encoder.layers.3.self_attn.out_proj.weight",
      "vision_encoder.layers.3.self_attn.out_proj.bias": "vision_encoder.layers.3.self_attn.out_proj.bias",
      "vision_encoder.layers.3.layer_norm1.weight": "vision_encoder.layers.3.layer_norm1.weight",
      "vision_encoder.layers.3.layer_norm1.bias": "vision_encoder.layers.3.layer_norm1.bias",
      "vision_encoder.layers.3.mlp.fc1.weight": "vision_encoder.layers.3.mlp.fc1.weight",
      "vision_encoder.layers.3.mlp.fc1.bias": "vision_encoder.layers.3.mlp.fc1.bias",
      "vision_encoder.layers.3.mlp.fc2.weight": "vision_encoder.layers.3.mlp.fc2.weight",
      "vision_encoder.layers.3.mlp.fc2.bias": "vision_encoder.layers.3.mlp.fc2.bias",
      "vision_encoder.layers.3.layer_norm2.weight": "vision_encoder.layers.3.layer_norm2.weight",
      "vision_encoder.layers.3.layer_norm2.bias": "vision_encoder.layers.3.layer_norm2.bias",
      "vision_encoder.layers.4.self_attn.q_proj.weight": "vision_encoder.layers.4.self_attn.q_proj.weight",
      "vision_encoder.layers.4.self_attn.q_proj.bias": "vision_encoder.layers.4.self_attn.q_proj.bias",
      "vision_encoder.layers.4.self_attn.k_proj.weight": "vision_encoder.layers.4.self_attn.k_proj.weight",
      "vision_encoder.layers.4.self_attn.k_proj.bias": "vision_encoder.layers.4.self_attn.k_proj.bias",
      "vision_encoder.layers.4.self_attn.v_proj.weight": "vision_encoder.layers.4.self_attn.v_proj.weight",
      "vision_encoder.layers.4.self_attn.v_proj.bias": "vision_encoder.layers.4.self_attn.v_proj.bias",
      "vision_encoder.layers.4.self_attn.out_proj.weight": "vision_encoder.layers.4.self_attn.out_proj.weight",
      "vision_encoder.layers.4.self_attn.out_proj.bias": "vision_encoder.layers.4.self_attn.out_proj.bias",
      "vision_encoder.layers.4.layer_norm1.weight": "vision_encoder.layers.4.layer_norm1.weight",
      "vision_encoder.layers.4.layer_norm1.bias": "vision_encoder.layers.4.layer_norm1.bias",
      "vision_encoder.layers.4.mlp.fc1.weight": "vision_encoder.layers.4.mlp.fc1.weight",
      "vision_encoder.layers.4.mlp.fc1.bias": "vision_encoder.layers.4.mlp.fc1.bias",
      "vision_encoder.layers.4.mlp.fc2.weight": "vision_encoder.layers.4.mlp.fc2.weight",
      "vision_encoder.layers.4.mlp.fc2.bias": "vision_encoder.layers.4.mlp.fc2.bias",
      "vision_encoder.layers.4.layer_norm2.weight": "vision_encoder.layers.4.layer_norm2.weight",
      "vision_encoder.layers.4.layer_norm2.bias": "vision_encoder.layers.4.layer_norm2.bias",
      "vision_encoder.layers.5.self_attn.q_proj.weight": "vision_encoder.layers.5.self_attn.q_proj.weight",
      "vision_encoder.layers.5.self_attn.q_proj.bias": "vision_encoder.layers.5.self_attn.q_proj.bias",
      "vision_encoder.layers.5.self_attn.k_proj.weight": "vision_encoder.layers.5.self_attn.k_proj.weight",
      "vision_encoder.layers.5.self_attn.k_proj.bias": "vision_encoder.layers.5.self_attn.k_proj.bias",
      "vision_encoder.layers.5.self_attn.v_proj.weight": "vision_encoder.layers.5.self_attn.v_proj.weight",
      "vision_encoder.layers.5.self_attn.v_proj.bias": "vision_encoder.layers.5.self_attn.v_proj.bias",
      "vision_encoder.layers.5.self_attn.out_proj.weight": "vision_encoder.layers.5.self_attn.out_proj.weight",
      "vision_encoder.layers.5.self_attn.out_proj.bias": "vision_encoder.layers.5.self_attn.out_proj.bias",
      "vision_encoder.layers.5.layer_norm1.weight": "vision_encoder.layers.5.layer_norm1.weight",
      "vision_encoder.layers.5.layer_norm1.bias": "vision_encoder.layers.5.layer_norm1.bias",
      "vision_encoder.layers.5.mlp.fc1.weight": "vision_encoder.layers.5.mlp.fc1.weight",
      "vision_encoder.layers.5.mlp.fc1.bias": "vision_encoder.layers.5.mlp.fc1.bias",
      "vision_encoder.layers.5.mlp.fc2.weight": "vision_encoder.layers.5.mlp.fc2.weight",
      "vision_encoder.layers.5.mlp.fc2.bias": "vision_encoder.layers.5.mlp.fc2.bias",
      "vision_encoder.layers.5.layer_norm2.weight": "vision_encoder.layers.5.layer_norm2.weight",
      "vision_encoder.layers.5.layer_norm2.bias": "vision_encoder.layers.5.layer_norm2.bias",
      "vision_encoder.layers.6.self_attn.q_proj.weight": "vision_encoder.layers.6.self_attn.q_proj.weight",
      "vision_encoder.layers.6.self_attn.q_proj.bias": "vision_encoder.layers.6.self_attn.q_proj.bias",
      "vision_encoder.layers.6.self_attn.k_proj.weight": "vision_encoder.layers.6.self_attn.k_proj.weight",
      "vision_encoder.layers.6.self_attn.k_proj.bias": "vision_encoder.layers.6.self_attn.k_proj.bias",
      "vision_encoder.layers.6.self_attn.v_proj.weight": "vision_encoder.layers.6.self_attn.v_proj.weight",
      "vision_encoder.layers.6.self_attn.v_proj.bias": "vision_encoder.layers.6.self_attn.v_proj.bias",
      "vision_encoder.layers.6.self_attn.out_proj.weight": "vision_encoder.layers.6.self_attn.out_proj.weight",
      "vision_encoder.layers.6.self_attn.out_proj.bias": "vision_encoder.layers.6.self_attn.out_proj.bias",
      "vision_encoder.layers.6.layer_norm1.weight": "vision_encoder.layers.6.layer_norm1.weight",
      "vision_encoder.layers.6.layer_norm1.bias": "vision_encoder.layers.6.layer_norm1.bias",
      "vision_encoder.layers.6.mlp.fc1.weight": "vision_encoder.layers.6.mlp.fc1.weight",
      "vision_encoder.layers.6.mlp.fc1.bias": "vision_encoder.layers.6.mlp.fc1.bias",
      "vision_encoder.layers.6.mlp.fc2.weight": "vision_encoder.layers.6.mlp.fc2.weight",
      "vision_encoder.layers.6.mlp.fc2.bias": "vision_encoder.layers.6.mlp.fc2.bias",
      "vision_encoder.layers.6.layer_norm2.weight": "vision_encoder.layers.6.layer_norm2.weight",
      "vision_encoder.layers.6.layer_norm2.bias": "vision_encoder.layers.6.layer_norm2.bias",
      "vision_encoder.layers.7.self_attn.q_proj.weight": "vision_encoder.layers.7.self_attn.q_proj.weight",
      "vision_encoder.layers.7.self_attn.q_proj.bias": "vision_encoder.layers.7.self_attn.q_proj.bias",
      "vision_encoder.layers.7.self_attn.k_proj.weight": "vision_encoder.layers.7.self_attn.k_proj.weight",
      "vision_encoder.layers.7.self_attn.k_proj.bias": "vision_encoder.layers.7.self_attn.k_proj.bias",
      "vision_encoder.layers.7.self_attn.v_proj.weight": "vision_encoder.layers.7.self_attn.v_proj.weight",
      "vision_encoder.layers.7.self_attn.v_proj.bias": "vision_encoder.layers.7.self_attn.v_proj.bias",
      "vision_encoder.layers.7.self_attn.out_proj.weight": "vision_encoder.layers.7.self_attn.out_proj.weight",
      "vision_encoder.layers.7.self_attn.out_proj.bias": "vision_encoder.layers.7.self_attn.out_proj.bias",
      "vision_encoder.layers.7.layer_norm1.weight": "vision_encoder.layers.7.layer_norm1.weight",
      "vision_encoder.layers.7.layer_norm1.bias": "vision_encoder.layers.7.layer_norm1.bias",
      "vision_encoder.layers.7.mlp.fc1.weight": "vision_encoder.layers.7.mlp.fc1.weight",
      "vision_encoder.layers.7.mlp.fc1.bias": "vision_encoder.layers.7.mlp.fc1.bias",
      "vision_encoder.layers.7.mlp.fc2.weight": "vision_encoder.layers.7.mlp.fc2.weight",
      "vision_encoder.layers.7.mlp.fc2.bias": "vision_encoder.layers.7.mlp.fc2.bias",
      "vision_encoder.layers.7.layer_norm2.weight": "vision_encoder.layers.7.layer_norm2.weight",
      "vision_encoder.layers.7.layer_norm2.bias": "vision_encoder.layers.7.layer_norm2.bias",
      "vision_encoder.layers.8.self_attn.q_proj.weight": "vision_encoder.layers.8.self_attn.q_proj.weight",
      "vision_encoder.layers.8.self_attn.q_proj.bias": "vision_encoder.layers.8.self_attn.q_proj.bias",
      "vision_encoder.layers.8.self_attn.k_proj.weight": "vision_encoder.layers.8.self_attn.k_proj.weight",
      "vision_encoder.layers.8.self_attn.k_proj.bias": "vision_encoder.layers.8.self_attn.k_proj.bias",
      "vision_encoder.layers.8.self_attn.v_proj.weight": "vision_encoder.layers.8.self_attn.v_proj.weight",
      "vision_encoder.layers.8.self_attn.v_proj.bias": "vision_encoder.layers.8.self_attn.v_proj.bias",
      "vision_encoder.layers.8.self_attn.out_proj.weight": "vision_encoder.layers.8.self_attn.out_proj.weight",
      "vision_encoder.layers.8.self_attn.out_proj.bias": "vision_encoder.layers.8.self_attn.out_proj.bias",
      "vision_encoder.layers.8.layer_norm1.weight": "vision_encoder.layers.8.layer_norm1.weight",
      "vision_encoder.layers.8.layer_norm1.bias": "vision_encoder.layers.8.layer_norm1.bias",
      "vision_encoder.layers.8.mlp.fc1.weight": "vision_encoder.layers.8.mlp.fc1.weight",
      "vision_encoder.layers.8.mlp.fc1.bias": "vision_encoder.layers.8.mlp.fc1.bias",
      "vision_encoder.layers.8.mlp.fc2.weight": "vision_encoder.layers.8.mlp.fc2.weight",
      "vision_encoder.layers.8.mlp.fc2.bias": "vision_encoder.layers.8.mlp.fc2.bias",
      "vision_encoder.layers.8.layer_norm2.weight": "vision_encoder.layers.8.layer_norm2.weight",
      "vision_encoder.layers.8.layer_norm2.bias": "vision_encoder.layers.8.layer_norm2.bias",
      "vision_encoder.layers.9.self_attn.q_proj.weight": "vision_encoder.layers.9.self_attn.q_proj.weight",
      "vision_encoder.layers.9.self_attn.q_proj.bias": "vision_encoder.layers.9.self_attn.q_proj.bias",
      "vision_encoder.layers.9.self_attn.k_proj.weight": "vision_encoder.layers.9.self_attn.k_proj.weight",
      "vision_encoder.layers.9.self_attn.k_proj.bias": "vision_encoder.layers.9.self_attn.k_proj.bias",
      "vision_encoder.layers.9.self_attn.v_proj.weight": "vision_encoder.layers.9.self_attn.v_proj.weight",
      "vision_encoder.layers.9.self_attn.v_proj.bias": "vision_encoder.layers.9.self_attn.v_proj.bias",
      "vision_encoder.layers.9.self_attn.out_proj.weight": "vision_encoder.layers.9.self_attn.out_proj.weight",
      "vision_encoder.layers.9.self_attn.out_proj.bias": "vision_encoder.layers.9.self_attn.out_proj.bias",
      "vision_encoder.layers.9.layer_norm1.weight": "vision_encoder.layers.9.layer_norm1.weight",
      "vision_encoder.layers.9.layer_norm1.bias": "vision_encoder.layers.9.layer_norm1.bias",
      "vision_encoder.layers.9.mlp.fc1.weight": "vision_encoder.layers.9.mlp.fc1.weight",
      "vision_encoder.layers.9.mlp.fc1.bias": "vision_encoder.layers.9.mlp.fc1.bias",
      "vision_encoder.layers.9.mlp.fc2.weight": "vision_encoder.layers.9.mlp.fc2.weight",
      "vision_encoder.layers.9.mlp.fc2.bias": "vision_encoder.layers.9.mlp.fc2.bias",
      "vision_encoder.layers.9.layer_norm2.weight": "vision_encoder.layers.9.layer_norm2.weight",
      "vision_encoder.layers.9.layer_norm2.bias": "vision_encoder.layers.9.layer_norm2.bias",
      "vision_encoder.layers.10.self_attn.q_proj.weight": "vision_encoder.layers.10.self_attn.q_proj.weight",
      "vision_encoder.layers.10.self_attn.q_proj.bias": "vision_encoder.layers.10.self_attn.q_proj.bias",
      "vision_encoder.layers.10.self_attn.k_proj.weight": "vision_encoder.layers.10.self_attn.k_proj.weight",
      "vision_encoder.layers.10.self_attn.k_proj.bias": "vision_encoder.layers.10.self_attn.k_proj.bias",
      "vision_encoder.layers.10.self_attn.v_proj.weight": "vision_encoder.layers.10.self_attn.v_proj.weight",
      "vision_encoder.layers.10.self_attn.v_proj.bias": "vision_encoder.layers.10.self_attn.v_proj.bias",
      "vision_encoder.layers.10.self_attn.out_proj.weight": "vision_encoder.layers.10.self_attn.out_proj.weight",
      "vision_encoder.layers.10.self_attn.out_proj.bias": "vision_encoder.layers.10.self_attn.out_proj.bias",
      "vision_encoder.layers.10.layer_norm1.weight": "vision_encoder.layers.10.layer_norm1.weight",
      "vision_encoder.layers.10.layer_norm1.bias": "vision_encoder.layers.10.layer_norm1.bias",
      "vision_encoder.layers.10.mlp.fc1.weight": "vision_encoder.layers.10.mlp.fc1.weight",
      "vision_encoder.layers.10.mlp.fc1.bias": "vision_encoder.layers.10.mlp.fc1.bias",
      "vision_encoder.layers.10.mlp.fc2.weight": "vision_encoder.layers.10.mlp.fc2.weight",
      "vision_encoder.layers.10.mlp.fc2.bias": "vision_encoder.layers.10.mlp.fc2.bias",
      "vision_encoder.layers.10.layer_norm2.weight": "vision_encoder.layers.10.layer_norm2.weight",
      "vision_encoder.layers.10.layer_norm2.bias": "vision_encoder.layers.10.layer_norm2.bias",
      "vision_encoder.layers.11.self_attn.q_proj.weight": "vision_encoder.layers.11.self_attn.q_proj.weight",
      "vision_encoder.layers.11.self_attn.q_proj.bias": "vision_encoder.layers.11.self_attn.q_proj.bias",
      "vision_encoder.layers.11.self_attn.k_proj.weight": "vision_encoder.layers.11.self_attn.k_proj.weight",
      "vision_encoder.layers.11.self_attn.k_proj.bias": "vision_encoder.layers.11.self_attn.k_proj.bias",
      "vision_encoder.layers.11.self_attn.v_proj.weight": "vision_encoder.layers.11.self_attn.v_proj.weight",
      "vision_encoder.layers.11.self_attn.v_proj.bias": "vision_encoder.layers.11.self_attn.v_proj.bias",
      "vision_encoder.layers.11.self_attn.out_proj.weight": "vision_encoder.layers.11.self_attn.out_proj.weight",
      "vision_encoder.layers.11.self_attn.out_proj.bias": "vision_encoder.layers.11.self_attn.out_proj.bias",
      "vision_encoder.layers.11.layer_norm1.weight": "vision_encoder.layers.11.layer_norm1.weight",
      "vision_encoder.layers.11.layer_norm1.bias": "vision_encoder.layers.11.layer_norm1.bias",
      "vision_encoder.layers.11.mlp.fc1.weight": "vision_encoder.layers.11.mlp.fc1.weight",
      "vision_encoder.layers.11.mlp.fc1.bias": "vision_encoder.layers.11.mlp.fc1.bias",
      "vision_encoder.layers.11.mlp.fc2.weight": "vision_encoder.layers.11.mlp.fc2.weight",
      "vision_encoder.layers.11.mlp.fc2.bias": "vision_encoder.layers.11.mlp.fc2.bias",
      "vision_encoder.layers.11.layer_norm2.weight": "vision_encoder.layers.11.layer_norm2.weight",
      "vision_encoder.layers.11.layer_norm2.bias": "vision_encoder.layers.11.layer_norm2.bias",
      "vision_encoder.post_layernorm.weight": "vision_encoder.post_layernorm.weight",
      "vision_encoder.post_layernorm.bias": "vision_encoder.post_layernorm.bias",
      "connector.proj.weight": "connector.proj.weight",
      "text_embed_tokens.weight": "text_embed_tokens.weight",
      "vlm_layers.0.input_layernorm.weight": "vlm_layers.0.input_layernorm.weight",
      "vlm_layers.0.q_proj.weight": "vlm_layers.0.q_proj.weight",
      "vlm_layers.0.k_proj.weight": "vlm_layers.0.k_proj.weight",
      "vlm_layers.0.v_proj.weight": "vlm_layers.0.v_proj.weight",
      "vlm_layers.0.o_proj.weight": "vlm_layers.0.o_proj.weight",
      "vlm_layers.0.post_attention_layernorm.weight": "vlm_layers.0.post_attention_layernorm.weight",
      "vlm_layers.0.mlp.gate_proj.weight": "vlm_layers.0.mlp.gate_proj.weight",
      "vlm_layers.0.mlp.up_proj.weight": "vlm_layers.0.mlp.up_proj.weight",
      "vlm_layers.0.mlp.down_proj.weight": "vlm_layers.0.mlp.down_proj.weight",
      "vlm_layers.1.input_layernorm.weight": "vlm_layers.1.input_layernorm.weight",
      "vlm_layers.1.q_proj.weight": "vlm_layers.1.q_proj.weight",
      "vlm_layers.1.k_proj.weight": "vlm_layers.1.k_proj.weight",
      "vlm_layers.1.v_proj.weight": "vlm_layers.1.v_proj.weight",
      "vlm_layers.1.o_proj.weight": "vlm_layers.1.o_proj.weight",
      "vlm_layers.1.post_attention_layernorm.weight": "vlm_layers.1.post_attention_layernorm.weight",
      "vlm_layers.1.mlp.gate_proj.weight": "vlm_layers.1.mlp.gate_proj.weight",
      "vlm_layers.1.mlp.up_proj.weight": "vlm_layers.1.mlp.up_proj.weight",
      "vlm_layers.1.mlp.down_proj.weight": "vlm_layers.1.mlp.down_proj.weight",
      "vlm_layers.2.input_layernorm.weight": "vlm_layers.2.input_layernorm.weight",
      "vlm_layers.2.q_proj.weight": "vlm_layers.2.q_proj.weight",
      "vlm_layers.2.k_proj.weight": "vlm_layers.2.k_proj.weight",
      "vlm_layers.2.v_proj.weight": "vlm_layers.2.v_proj.weight",
      "vlm_layers.2.o_proj.weight": "vlm_layers.2.o_proj.weight",
      "vlm_layers.2.post_attention_layernorm.weight": "vlm_layers.2.post_attention_layernorm.weight",
      "vlm_layers.2.mlp.gate_proj.weight": "vlm_layers.2.mlp.gate_proj.weight",
      "vlm_layers.2.mlp.up_proj.weight": "vlm_layers.2.mlp.up_proj.weight",
      "vlm_layers.2.mlp.down_proj.weight": "vlm_layers.2.mlp.down_proj.weight",
      "vlm_layers.3.input_layernorm.weight": "vlm_layers.3.input_layernorm.weight",
      "vlm_layers.3.q_proj.weight": "vlm_layers.3.q_proj.weight",
      "vlm_layers.3.k_proj.weight": "vlm_layers.3.k_proj.weight",
      "vlm_layers.3.v_proj.weight": "vlm_layers.3.v_proj.weight",
      "vlm_layers.3.o_proj.weight": "vlm_layers.3.o_proj.weight",
      "vlm_layers.3.post_attention_layernorm.weight": "vlm_layers.3.post_attention_layernorm.weight",
      "vlm_layers.3.mlp.gate_proj.weight": "vlm_layers.3.mlp.gate_proj.weight",
      "vlm_layers.3.mlp.up_proj.weight": "vlm_layers.3.mlp.up_proj.weight",
      "vlm_layers.3.mlp.down_proj.weight": "vlm_layers.3.mlp.down_proj.weight",
      "vlm_layers.4.input_layernorm.weight": "vlm_layers.4.input_layernorm.weight",
      "vlm_layers.4.q_proj.weight": "vlm_layers.4.q_proj.weight",
      "vlm_layers.4.k_proj.weight": "vlm_layers.4.k_proj.weight",
      "vlm_layers.4.v_proj.weight": "vlm_layers.4.v_proj.weight",
      "vlm_layers.4.o_proj.weight": "vlm_layers.4.o_proj.weight",
      "vlm_layers.4.post_attention_layernorm.weight": "vlm_layers.4.post_attention_layernorm.weight",
      "vlm_layers.4.mlp.gate_proj.weight": "vlm_layers.4.mlp.gate_proj.weight",
      "vlm_layers.4.mlp.up_proj.weight": "vlm_layers.4.mlp.up_proj.weight",
      "vlm_layers.4.mlp.down_proj.weight": "vlm_layers.4.mlp.down_proj.weight",
      "vlm_layers.5.input_layernorm.weight": "vlm_layers.5.input_layernorm.weight",
      "vlm_layers.5.q_proj.weight": "vlm_layers.5.q_proj.weight",
      "vlm_layers.5.k_proj.weight": "vlm_layers.5.k_proj.weight",
      "vlm_layers.5.v_proj.weight": "vlm_layers.5.v_proj.weight",
      "vlm_layers.5.o_proj.weight": "vlm_layers.5.o_proj.weight",
      "vlm_layers.5.post_attention_layernorm.weight": "vlm_layers.5.post_attention_layernorm.weight",
      "vlm_layers.5.mlp.gate_proj.weight": "vlm_layers.5.mlp.gate_proj.weight",
      "vlm_layers.5.mlp.up_proj.weight": "vlm_layers.5.mlp.up_proj.weight",
      "vlm_layers.5.mlp.down_proj.weight": "vlm_layers.5.mlp.down_proj.weight",
      "vlm_layers.6.input_layernorm.weight": "vlm_layers.6.input_layernorm.weight",
      "vlm_layers.6.q_proj.weight": "vlm_layers.6.q_proj.weight",
      "vlm_layers.6.k_proj.weight": "vlm_layers.6.k_proj.weight",
      "vlm_layers.6.v_proj.weight": "vlm_layers.6.v_proj.weight",
      "vlm_layers.6.o_proj.weight": "vlm_layers.6.o_proj.weight",
      "vlm_layers.6.post_attention_layernorm.weight": "vlm_layers.6.post_attention_layernorm.weight",
      "vlm_layers.6.mlp.gate_proj.weight": "vlm_layers.6.mlp.gate_proj.weight",
      "vlm_layers.6.mlp.up_proj.weight": "vlm_layers.6.mlp.up_proj.weight",
      "vlm_layers.6.mlp.down_proj.weight": "vlm_layers.6.mlp.down_proj.weight",
      "vlm_layers.7.input_layernorm.weight": "vlm_layers.7.input_layernorm.weight",
      "vlm_layers.7.q_proj.weight": "vlm_layers.7.q_proj.weight",
      "vlm_layers.7.k_proj.weight": "vlm_layers.7.k_proj.weight",
      "vlm_layers.7.v_proj.weight": "vlm_layers.7.v_proj.weight",
      "vlm_layers.7.o_proj.weight": "vlm_layers.7.o_proj.weight",
      "vlm_layers.7.post_attention_layernorm.weight": "vlm_layers.7.post_attention_layernorm.weight",
      "vlm_layers.7.mlp.gate_proj.weight": "vlm_layers.7.mlp.gate_proj.weight",
      "vlm_layers.7.mlp.up_proj.weight": "vlm_layers.7.mlp.up_proj.weight",
      "vlm_layers.7.mlp.down_proj.weight": "vlm_layers.7.mlp.down_proj.weight",
      "vlm_layers.8.input_layernorm.weight": "vlm_layers.8.input_layernorm.weight",
      "vlm_layers.8.q_proj.weight": "vlm_layers.8.q_proj.weight",
      "vlm_layers.8.k_proj.weight": "vlm_layers.8.k_proj.weight",
      "vlm_layers.8.v_proj.weight": "vlm_layers.8.v_proj.weight",
      "vlm_layers.8.o_proj.weight": "vlm_layers.8.o_proj.weight",
      "vlm_layers.8.post_attention_layernorm.weight": "vlm_layers.8.post_attention_layernorm.weight",
      "vlm_layers.8.mlp.gate_proj.weight": "vlm_layers.8.mlp.gate_proj.weight",
      "vlm_layers.8.mlp.up_proj.weight": "vlm_layers.8.mlp.up_proj.weight",
      "vlm_layers.8.mlp.down_proj.weight": "vlm_layers.8.mlp.down_proj.weight",
      "vlm_layers.9.input_layernorm.weight": "vlm_layers.9.input_layernorm.weight",
      "vlm_layers.9.q_proj.weight": "vlm_layers.9.q_proj.weight",
      "vlm_layers.9.k_proj.weight": "vlm_layers.9.k_proj.weight",
      "vlm_layers.9.v_proj.weight": "vlm_layers.9.v_proj.weight",
      "vlm_layers.9.o_proj.weight": "vlm_layers.9.o_proj.weight",
      "vlm_layers.9.post_attention_layernorm.weight": "vlm_layers.9.post_attention_layernorm.weight",
      "vlm_layers.9.mlp.gate_proj.weight": "vlm_layers.9.mlp.gate_proj.weight",
      "vlm_layers.9.mlp.up_proj.weight": "vlm_layers.9.mlp.up_proj.weight",
      "vlm_layers.9.mlp.down_proj.weight": "vlm_layers.9.mlp.down_proj.weight",
      "vlm_layers.10.input_layernorm.weight": "vlm_layers.10.input_layernorm.weight",
      "vlm_layers.10.q_proj.weight": "vlm_layers.10.q_proj.weight",
      "vlm_layers.10.k_proj.weight": "vlm_layers.10.k_proj.weight",
      "vlm_layers.10.v_proj.weight": "vlm_layers.10.v_proj.weight",
      "vlm_layers.10.o_proj.weight": "vlm_layers.10.o_proj.weight",
      "vlm_layers.10.post_attention_layernorm.weight": "vlm_layers.10.post_attention_layernorm.weight",
      "vlm_layers.10.mlp.gate_proj.weight": "vlm_layers.10.mlp.gate_proj.weight",
      "vlm_layers.10.mlp.up_proj.weight": "vlm_layers.10.mlp.up_proj.weight",
      "vlm_layers.10.mlp.down_proj.weight": "vlm_layers.10.mlp.down_proj.weight",
      "vlm_layers.11.input_layernorm.weight": "vlm_layers.11.input_layernorm.weight",
      "vlm_layers.11.q_proj.weight": "vlm_layers.11.q_proj.weight",
      "vlm_layers.11.k_proj.weight": "vlm_layers.11.k_proj.weight",
      "vlm_layers.11.v_proj.weight": "vlm_layers.11.v_proj.weight",
      "vlm_layers.11.o_proj.weight": "vlm_layers.11.o_proj.weight",
      "vlm_layers.11.post_attention_layernorm.weight": "vlm_layers.11.post_attention_layernorm.weight",
      "vlm_layers.11.mlp.gate_proj.weight": "vlm_layers.11.mlp.gate_proj.weight",
      "vlm_layers.11.mlp.up_proj.weight": "vlm_layers.11.mlp.up_proj.weight",
      "vlm_layers.11.mlp.down_proj.weight": "vlm_layers.11.mlp.down_proj.weight",
      "vlm_layers.12.input_layernorm.weight": "vlm_layers.12.input_layernorm.weight",
      "vlm_layers.12.q_proj.weight": "vlm_layers.12.q_proj.weight",
      "vlm_layers.12.k_proj.weight": "vlm_layers.12.k_proj.weight",
      "vlm_layers.12.v_proj.weight": "vlm_layers.12.v_proj.weight",
      "vlm_layers.12.o_proj.weight": "vlm_layers.12.o_proj.weight",
      "vlm_layers.12.post_attention_layernorm.weight": "vlm_layers.12.post_attention_layernorm.weight",
      "vlm_layers.12.mlp.gate_proj.weight": "vlm_layers.12.mlp.gate_proj.weight",
      "vlm_layers.12.mlp.up_proj.weight": "vlm_layers.12.mlp.up_proj.weight",
      "vlm_layers.12.mlp.down_proj.weight": "vlm_layers.12.mlp.down_proj.weight",
      "vlm_layers.13.input_layernorm.weight": "vlm_layers.13.input_layernorm.weight",
      "vlm_layers.13.q_proj.weight": "vlm_layers.13.q_proj.weight",
      "vlm_layers.13.k_proj.weight": "vlm_layers.13.k_proj.weight",
      "vlm_layers.13.v_proj.weight": "vlm_layers.13.v_proj.weight",
      "vlm_layers.13.o_proj.weight": "vlm_layers.13.o_proj.weight",
      "vlm_layers.13.post_attention_layernorm.weight": "vlm_layers.13.post_attention_layernorm.weight",
      "vlm_layers.13.mlp.gate_proj.weight": "vlm_layers.13.mlp.gate_proj.weight",
      "vlm_layers.13.mlp.up_proj.weight": "vlm_layers.13.mlp.up_proj.weight",
      "vlm_layers.13.mlp.down_proj.weight": "vlm_layers.13.mlp.down_proj.weight",
      "vlm_layers.14.input_layernorm.weight": "vlm_layers.14.input_layernorm.weight",
      "vlm_layers.14.q_proj.weight": "vlm_layers.14.q_proj.weight",
      "vlm_layers.14.k_proj.weight": "vlm_layers.14.k_proj.weight",
      "vlm_layers.14.v_proj.weight": "vlm_layers.14.v_proj.weight",
      "vlm_layers.14.o_proj.weight": "vlm_layers.14.o_proj.weight",
      "vlm_layers.14.post_attention_layernorm.weight": "vlm_layers.14.post_attention_layernorm.weight",
      "vlm_layers.14.mlp.gate_proj.weight": "vlm_layers.14.mlp.gate_proj.weight",
      "vlm_layers.14.mlp.up_proj.weight": "vlm_layers.14.mlp.up_proj.weight",
      "vlm_layers.14.mlp.down_proj.weight": "vlm_layers.14.mlp.down_proj.weight",
      "vlm_layers.15.input_layernorm.weight": "vlm_layers.15.input_layernorm.weight",
      "vlm_layers.15.q_proj.weight": "vlm_layers.15.q_proj.weight",
      "vlm_layers.15.k_proj.weight": "vlm_layers.15.k_proj.weight",
      "vlm_layers.15.v_proj.weight": "vlm_layers.15.v_proj.weight",
      "vlm_layers.15.o_proj.weight": "vlm_layers.15.o_proj.weight",
      "vlm_layers.15.post_attention_layernorm.weight": "vlm_layers.15.post_attention_layernorm.weight",
      "vlm_layers.15.mlp.gate_proj.weight": "vlm_layers.15.mlp.gate_proj.weight",
      "vlm_layers.15.mlp.up_proj.weight": "vlm_layers.15.mlp.up_proj.weight",
      "vlm_layers.15.mlp.down_proj.weight": "vlm_layers.15.mlp.down_proj.weight",
      "expert_layers.0.input_layernorm.weight": "expert_layers.0.input_layernorm.weight",
      "expert_layers.0.q_proj.weight": "expert_layers.0.q_proj.weight",
      "expert_layers.0.k_proj.weight": "expert_layers.0.k_proj.weight",
      "expert_layers.0.v_proj.weight": "expert_layers.0.v_proj.weight",
      "expert_layers.0.o_proj.weight": "expert_layers.0.o_proj.weight",
      "expert_layers.0.post_attention_layernorm.weight": "expert_layers.0.post_attention_layernorm.weight",
      "expert_layers.0.mlp.gate_proj.weight": "expert_layers.0.mlp.gate_proj.weight",
      "expert_layers.0.mlp.up_proj.weight": "expert_layers.0.mlp.up_proj.weight",
      "expert_layers.0.mlp.down_proj.weight": "expert_layers.0.mlp.down_proj.weight",
      "expert_layers.1.input_layernorm.weight": "expert_layers.1.input_layernorm.weight",
      "expert_layers.1.q_proj.weight": "expert_layers.1.q_proj.weight",
      "expert_layers.1.k_proj.weight": "expert_layers.1.k_proj.weight",
      "expert_layers.1.v_proj.weight": "expert_layers.1.v_proj.weight",
      "expert_layers.1.o_proj.weight": "expert_layers.1.o_proj.weight",
      "expert_layers.1.post_attention_layernorm.weight": "expert_layers.1.post_attention_layernorm.weight",
      "expert_layers.1.mlp.gate_proj.weight": "expert_layers.1.mlp.gate_proj.weight",
      "expert_layers.1.mlp.up_proj.weight": "expert_layers.1.mlp.up_proj.weight",
      "expert_layers.1.mlp.down_proj.weight": "expert_layers.1.mlp.down_proj.weight",
      "expert_layers.2.input_layernorm.weight": "expert_layers.2.input_layernorm.weight",
      "expert_layers.2.q_proj.weight": "expert_layers.2.q_proj.weight",
      "expert_layers.2.k_proj.weight": "expert_layers.2.k_proj.weight",
      "expert_layers.2.v_proj.weight": "expert_layers.2.v_proj.weight",
      "expert_layers.2.o_proj.weight": "expert_layers.2.o_proj.weight",
      "expert_layers.2.post_attention_layernorm.weight": "expert_layers.2.post_attention_layernorm.weight",
      "expert_layers.2.mlp.gate_proj.weight": "expert_layers.2.mlp.gate_proj.weight",
      "expert_layers.2.mlp.up_proj.weight": "expert_layers.2.mlp.up_proj.weight",
      "expert_layers.2.mlp.down_proj.weight": "expert_layers.2.mlp.down_proj.weight",
      "expert_layers.3.input_layernorm.weight": "expert_layers.3.input_layernorm.weight",
      "expert_layers.3.q_proj.weight": "expert_layers.3.q_proj.weight",
      "expert_layers.3.k_proj.weight": "expert_layers.3.k_proj.weight",
      "expert_layers.3.v_proj.weight": "expert_layers.3.v_proj.weight",
      "expert_layers.3.o_proj.weight": "expert_layers.3.o_proj.weight",
      "expert_layers.3.post_attention_layernorm.weight": "expert_layers.3.post_attention_layernorm.weight",
      "expert_layers.3.mlp.gate_proj.weight": "expert_layers.3.mlp.gate_proj.weight",
      "expert_layers.3.mlp.up_proj.weight": "expert_layers.3.mlp.up_proj.weight",
      "expert_layers.3.mlp.down_proj.weight": "expert_layers.3.mlp.down_proj.weight",
      "expert_layers.4.input_layernorm.weight": "expert_layers.4.input_layernorm.weight",
      "expert_layers.4.q_proj.weight": "expert_layers.4.q_proj.weight",
      "expert_layers.4.k_proj.weight": "expert_layers.4.k_proj.weight",
      "expert_layers.4.v_proj.weight": "expert_layers.4.v_proj.weight",
      "expert_layers.4.o_proj.weight": "expert_layers.4.o_proj.weight",
      "expert_layers.4.post_attention_layernorm.weight": "expert_layers.4.post_attention_layernorm.weight",
      "expert_layers.4.mlp.gate_proj.weight": "expert_layers.4.mlp.gate_proj.weight",
      "expert_layers.4.mlp.up_proj.weight": "expert_layers.4.mlp.up_proj.weight",
      "expert_layers.4.mlp.down_proj.weight": "expert_layers.4.mlp.down_proj.weight",
      "expert_layers.5.input_layernorm.weight": "expert_layers.5.input_layernorm.weight",
      "expert_layers.5.q_proj.weight": "expert_layers.5.q_proj.weight",
      "expert_layers.5.k_proj.weight": "expert_layers.5.k_proj.weight",
      "expert_layers.5.v_proj.weight": "expert_layers.5.v_proj.weight",
      "expert_layers.5.o_proj.weight": "expert_layers.5.o_proj.weight",
      "expert_layers.5.post_attention_layernorm.weight": "expert_layers.5.post_attention_layernorm.weight",
      "expert_layers.5.mlp.gate_proj.weight": "expert_layers.5.mlp.gate_proj.weight",
      "expert_layers.5.mlp.up_proj.weight": "expert_layers.5.mlp.up_proj.weight",
      "expert_layers.5.mlp.down_proj.weight": "expert_layers.5.mlp.down_proj.weight",
      "expert_layers.6.input_layernorm.weight": "expert_layers.6.input_layernorm.weight",
      "expert_layers.6.q_proj.weight": "expert_layers.6.q_proj.weight",
      "expert_layers.6.k_proj.weight": "expert_layers.6.k_proj.weight",
      "expert_layers.6.v_proj.weight": "expert_layers.6.v_proj.weight",
      "expert_layers.6.o_proj.weight": "expert_layers.6.o_proj.weight",
      "expert_layers.6.post_attention_layernorm.weight": "expert_layers.6.post_attention_layernorm.weight",
      "expert_layers.6.mlp.gate_proj.weight": "expert_layers.6.mlp.gate_proj.weight",
      "expert_layers.6.mlp.up_proj.weight": "expert_layers.6.mlp.up_proj.weight",
      "expert_layers.6.mlp.down_proj.weight": "expert_layers.6.mlp.down_proj.weight",
      "expert_layers.7.input_layernorm.weight": "expert_layers.7.input_layernorm.weight",
      "expert_layers.7.q_proj.weight": "expert_layers.7.q_proj.weight",
      "expert_layers.7.k_proj.weight": "expert_layers.7.k_proj.weight",
      "expert_layers.7.v_proj.weight": "expert_layers.7.v_proj.weight",
      "expert_layers.7.o_proj.weight": "expert_layers.7.o_proj.weight",
      "expert_layers.7.post_attention_layernorm.weight": "expert_layers.7.post_attention_layernorm.weight",
      "expert_layers.7.mlp.gate_proj.weight": "expert_layers.7.mlp.gate_proj.weight",
      "expert_layers.7.mlp.up_proj.weight": "expert_layers.7.mlp.up_proj.weight",
      "expert_layers.7.mlp.down_proj.weight": "expert_layers.7.mlp.down_proj.weight",
      "expert_layers.8.input_layernorm.weight": "expert_layers.8.input_layernorm.weight",
      "expert_layers.8.q_proj.weight": "expert_layers.8.q_proj.weight",
      "expert_layers.8.k_proj.weight": "expert_layers.8.k_proj.weight",
      "expert_layers.8.v_proj.weight": "expert_layers.8.v_proj.weight",
      "expert_layers.8.o_proj.weight": "expert_layers.8.o_proj.weight",
      "expert_layers.8.post_attention_layernorm.weight": "expert_layers.8.post_attention_layernorm.weight",
      "expert_layers.8.mlp.gate_proj.weight": "expert_layers.8.mlp.gate_proj.weight",
      "expert_layers.8.mlp.up_proj.weight": "expert_layers.8.mlp.up_proj.weight",
      "expert_layers.8.mlp.down_proj.weight": "expert_layers.8.mlp.down_proj.weight",
      "expert_layers.9.input_layernorm.weight": "expert_layers.9.input_layernorm.weight",
      "expert_layers.9.q_proj.weight": "expert_layers.9.q_proj.weight",
      "expert_layers.9.k_proj.weight": "expert_layers.9.k_proj.weight",
      "expert_layers.9.v_proj.weight": "expert_layers.9.v_proj.weight",
      "expert_layers.9.o_proj.weight": "expert_layers.9.o_proj.weight",
      "expert_layers.9.post_attention_layernorm.weight": "expert_layers.9.post_attention_layernorm.weight",
      "expert_layers.9.mlp.gate_proj.weight": "expert_layers.9.mlp.gate_proj.weight",
      "expert_layers.9.mlp.up_proj.weight": "expert_layers.9.mlp.up_proj.weight",
      "expert_layers.9.mlp.down_proj.weight": "expert_layers.9.mlp.down_proj.weight",
      "expert_layers.10.input_layernorm.weight": "expert_layers.10.input_layernorm.weight",
      "expert_layers.10.q_proj.weight": "expert_layers.10.q_proj.weight",
      "expert_layers.10.k_proj.weight": "expert_layers.10.k_proj.weight",
      "expert_layers.10.v_proj.weight": "expert_layers.10.v_proj.weight",
      "expert_layers.10.o_proj.weight": "expert_layers.10.o_proj.weight",
      "expert_layers.10.post_attention_layernorm.weight": "expert_layers.10.post_attention_layernorm.weight",
      "expert_layers.10.mlp.gate_proj.weight": "expert_layers.10.mlp.gate_proj.weight",
      "expert_layers.10.mlp.up_proj.weight": "expert_layers.10.mlp.up_proj.weight",
      "expert_layers.10.mlp.down_proj.weight": "expert_layers.10.mlp.down_proj.weight",
      "expert_layers.11.input_layernorm.weight": "expert_layers.11.input_layernorm.weight",
      "expert_layers.11.q_proj.weight": "expert_layers.11.q_proj.weight",
      "expert_layers.11.k_proj.weight": "expert_layers.11.k_proj.weight",
      "expert_layers.11.v_proj.weight": "expert_layers.11.v_proj.weight",
      "expert_layers.11.o_proj.weight": "expert_layers.11.o_proj.weight",
      "expert_layers.11.post_attention_layernorm.weight": "expert_layers.11.post_attention_layernorm.weight",
      "expert_layers.11.mlp.gate_proj.weight": "expert_layers.11.mlp.gate_proj.weight",
      "expert_layers.11.mlp.up_proj.weight": "expert_layers.11.mlp.up_proj.weight",
      "expert_layers.11.mlp.down_proj.weight": "expert_layers.11.mlp.down_proj.weight",
      "expert_layers.12.input_layernorm.weight": "expert_layers.12.input_layernorm.weight",
      "expert_layers.12.q_proj.weight": "expert_layers.12.q_proj.weight",
      "expert_layers.12.k_proj.weight": "expert_layers.12.k_proj.weight",
      "expert_layers.12.v_proj.weight": "expert_layers.12.v_proj.weight",
      "expert_layers.12.o_proj.weight": "expert_layers.12.o_proj.weight",
      "expert_layers.12.post_attention_layernorm.weight": "expert_layers.12.post_attention_layernorm.weight",
      "expert_layers.12.mlp.gate_proj.weight": "expert_layers.12.mlp.gate_proj.weight",
      "expert_layers.12.mlp.up_proj.weight": "expert_layers.12.mlp.up_proj.weight",
      "expert_layers.12.mlp.down_proj.weight": "expert_layers.12.mlp.down_proj.weight",
      "expert_layers.13.input_layernorm.weight": "expert_layers.13.input_layernorm.weight",
      "expert_layers.13.q_proj.weight": "expert_layers.13.q_proj.weight",
      "expert_layers.13.k_proj.weight": "expert_layers.13.k_proj.weight",
      "expert_layers.13.v_proj.weight": "expert_layers.13.v_proj.weight",
      "expert_layers.13.o_proj.weight": "expert_layers.13.o_proj.weight",
      "expert_layers.13.post_attention_layernorm.weight": "expert_layers.13.post_attention_layernorm.weight",
      "expert_layers.13.mlp.gate_proj.weight": "expert_layers.13.mlp.gate_proj.weight",
      "expert_layers.13.mlp.up_proj.weight": "expert_layers.13.mlp.up_proj.weight",
      "expert_layers.13.mlp.down_proj.weight": "expert_layers.13.mlp.down_proj.weight",
      "expert_layers.14.input_layernorm.weight": "expert_layers.14.input_layernorm.weight",
      "expert_layers.14.q_proj.weight": "expert_layers.14.q_proj.weight",
      "expert_layers.14.k_proj.weight": "expert_layers.14.k_proj.weight",
      "expert_layers.14.v_proj.weight": "expert_layers.14.v_proj.weight",
      "expert_layers.14.o_proj.weight": "expert_layers.14.o_proj.weight",
      "expert_layers.14.post_attention_layernorm.weight": "expert_layers.14.post_attention_layernorm.weight",
      "expert_layers.14.mlp.gate_proj.weight": "expert_layers.14.mlp.gate_proj.weight",
      "expert_layers.14.mlp.up_proj.weight": "expert_layers.14.mlp.up_proj.weight",
      "expert_layers.14.mlp.down_proj.weight": "expert_layers.14.mlp.down_proj.weight",
      "expert_layers.15.input_layernorm.weight": "expert_layers.15.input_layernorm.weight",
      "expert_layers.15.q_proj.weight": "expert_layers.15.q_proj.weight",
      "expert_layers.15.k_proj.weight": "expert_layers.15.k_proj.weight",
      "expert_layers.15.v_proj.weight": "expert_layers.15.v_proj.weight",
      "expert_layers.15.o_proj.weight": "expert_layers.15.o_proj.weight",
      "expert_layers.15.post_attention_layernorm.weight": "expert_layers.15.post_attention_layernorm.weight",
      "expert_layers.15.mlp.gate_proj.weight": "expert_layers.15.mlp.gate_proj.weight",
      "expert_layers.15.mlp.up_proj.weight": "expert_layers.15.mlp.up_proj.weight",
      "expert_layers.15.mlp.down_proj.weight": "expert_layers.15.mlp.down_proj.weight",
      "vlm_norm.weight": "vlm_norm.weight",
      "expert_norm.weight": "expert_norm.weight",
      "state_proj.weight": "state_proj.weight",
      "state_proj.bias": "state_proj.bias",
      "action_in_proj.weight": "action_in_proj.weight",
      "action_in_proj.bias": "action_in_proj.bias",
      "action_out_proj.weight": "action_out_proj.weight",
      "action_out_proj.bias": "action_out_proj.bias",
      "action_time_mlp_in.weight": "action_time_mlp_in.weight",
      "action_time_mlp_in.bias": "action_time_mlp_in.bias",
      "action_time_mlp_out.weight": "action_time_mlp_out.weight",
      "action_time_mlp_out.bias": "action_time_mlp_out.bias"
    }
  },
  "numerical_comparison": {
    "status": "PASS",
    "rtol": 1e-05,
    "atol": 1e-06,
    "input_dtype": "torch.float32",
    "num_trials": 3,
    "max_diff_across_trials": 0.0,
    "trials": [
      {
        "trial": 0,
        "seed": 42,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              1,
              50,
              32
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      },
      {
        "trial": 1,
        "seed": 43,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              1,
              50,
              32
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      },
      {
        "trial": 2,
        "seed": 44,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              1,
              50,
              32
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      }
    ]
  }
}