{
  "timestamp": "2026-03-05T01:37:29.827655",
  "original_file": "C:\\Users\\liang\\decomposition_workspace\\decompose-workspace\\iteration-1\\eval-0-gemm-add-relu\\with_skill\\outputs\\steps\\step_1_gemm_add_relu_to_kernels\\original.py",
  "refactored_file": "C:\\Users\\liang\\decomposition_workspace\\decompose-workspace\\iteration-1\\eval-0-gemm-add-relu\\with_skill\\outputs\\steps\\step_1_gemm_add_relu_to_kernels\\refactored.py",
  "status": "PASS",
  "anticheat": {
    "status": "PASS",
    "violations": [],
    "source_violations": [],
    "parameter_violations": []
  },
  "weight_transfer": {
    "status": "OK",
    "mapped_count": 2,
    "unmapped_original": [],
    "unmapped_refactored": [],
    "weight_map": {
      "bias": "bias_add.bias",
      "gemm.weight": "gemm.linear.weight"
    }
  },
  "numerical_comparison": {
    "status": "PASS",
    "rtol": 1e-05,
    "atol": 1e-06,
    "input_dtype": "torch.float32",
    "num_trials": 3,
    "max_diff_across_trials": 0.0,
    "trials": [
      {
        "trial": 0,
        "seed": 42,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              1024,
              8192
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      },
      {
        "trial": 1,
        "seed": 43,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              1024,
              8192
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      },
      {
        "trial": 2,
        "seed": 44,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              1024,
              8192
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      }
    ]
  }
}